#include "bytes.h"

/*******************************************************************************
 * @brief 将u16数据以大端序写入字节流
 * @param pbuf 缓冲区地址
 * @param a 要写入的数据
 * @return None
 ******************************************************************************/
inline void pack_big_16(uint8_t *pbuf, uint16_t a)
{
    *(pbuf + 0) = (uint8_t)((uint16_t)(a) >> 8);
    *(pbuf + 1) = (uint8_t)((uint16_t)(a) >> 0);
}

/*******************************************************************************
 * @brief 将u16数据以大端序写入字节流
 * @param pbuf 缓冲区地址
 * @param a 要写入的数据
 * @return None
 ******************************************************************************/
inline void pack_big_32(uint8_t *pbuf, uint32_t a)
{
    *(pbuf + 0) = (uint8_t)(a >> 24);
    *(pbuf + 1) = (uint8_t)(a >> 16);
    *(pbuf + 2) = (uint8_t)(a >> 8);
    *(pbuf + 3) = (uint8_t)(a >> 0);
}

/*******************************************************************************
 * @brief 以大端序读取字节流中的u16数据
 * @param pbuf 缓冲区地址
 * @return 读取到的数据
 ******************************************************************************/
inline uint16_t unpack_big_16(uint8_t *pbuf)
{
    return ((uint16_t)(*(pbuf + 0)) << 8) |
           ((uint16_t)(*(pbuf + 1)) << 0);
}

/*******************************************************************************
 * @brief 以大端序读取字节流中的u32数据
 * @param pbuf 缓冲区地址
 * @return 读取到的数据
 ******************************************************************************/
inline uint32_t unpack_big_32(uint8_t *pbuf)
{
    return (uint16_t)(*(pbuf + 0) << 24) |
           (uint16_t)(*(pbuf + 1) << 16) |
           (uint16_t)(*(pbuf + 2) << 8) |
           (uint16_t)(*(pbuf + 3) << 0);
}

/*******************************************************************************
 * @brief 将u16数据以小端序写入字节流
 * @param pbuf 缓冲区地址
 * @param a 要写入的数据
 * @return None
 ******************************************************************************/
inline void pack_little_16(uint8_t *pbuf, uint16_t a)
{
    *(pbuf + 0) = (uint8_t)(a >> 0);
    *(pbuf + 1) = (uint8_t)(a >> 8);
}

/*******************************************************************************
 * @brief 将u32数据以小端序写入字节流
 * @param pbuf 缓冲区地址
 * @param a 要写入的数据
 * @return None
 ******************************************************************************/
inline void pack_little_32(uint8_t *pbuf, uint32_t a)
{
    *(pbuf + 0) = (uint8_t)(a >> 0);
    *(pbuf + 1) = (uint8_t)(a >> 8);
    *(pbuf + 2) = (uint8_t)(a >> 16);
    *(pbuf + 3) = (uint8_t)(a >> 24);
}

/*******************************************************************************
 * @brief 以小端序读取字节流中的u16数据
 * @param pbuf 缓冲区地址
 * @return 读取到的数据
 ******************************************************************************/
inline uint16_t unpack_little_16(uint8_t *pbuf)
{
    return ((uint16_t)(*(pbuf + 0)) << 0) |
           (uint16_t)(*(pbuf + 1) << 8);
}

/*******************************************************************************
 * @brief 以小端序读取字节流中的u32数据
 * @param pbuf 缓冲区地址
 * @return 读取到的数据
 ******************************************************************************/
inline uint32_t unpack_little_32(uint8_t *pbuf)
{
    return (uint32_t)(*(pbuf + 0) << 0) |
           (uint32_t)(*(pbuf + 1) << 8) |
           (uint32_t)(*(pbuf + 2) << 16) |
           (uint32_t)(*(pbuf + 3) << 24);
}
